namespace Task12._3._3
{
    
    // Реализуйте метод, который будет возвращать индекс элемента в отсортированном массиве, 
    // на место которого можно будет вставить элемент так, чтобы не нарушить порядок сортировки.  
    // Реализуйте метод, который будет возвращать индекс элемента в отсортированном массиве, 
    // и что числа в нём не повторяются;
    //при вставке элемента по индексу, который будет возвращен, оставшаяся часть массива будет сдвигаться вправо.
   
    internal class Program
    {
        static void Main(string[] args)
        {
           
        }
    }
}
